---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.Dispose
source: html/06fc660b-92a4-6d92-0e08-53d3f106b55c.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData.Dispose Method

Releases all resources used by the DuctFittingAndAccessoryPressureDropData

## Syntax (C#)
```csharp
public void Dispose()
```